import { UiStateInterface } from '@/Interfaces/Interfces';
import { createSlice, PayloadAction } from '@reduxjs/toolkit';


const initialState: UiStateInterface['mainPage'] = {
  bannerSection: {
    slides:[
        {name: 'Slide_1', img: '/assets/baners/apysu.png', url: '/conatcts'},
        {name: 'Slide_2', img: '/assets/baners/apysu.png', url: '/conatcts'},
        {name: 'Slide_3', img: '/assets/baners/apysu.png', url: '/conatcts'}
    ],
    greenButtons: [
        {name: "Отримати результати", url: '/', img: '/assets/ico/results.svg'},
        {name: "Програма лояльності", url: '/', img: '/assets/ico/results.svg'},
        {name: "Акції", url: '/actions', img: '/assets/ico/results.svg'},
        {name: "Виїзд на дім", url: '/', img: '/assets/ico/results.svg'},
        {name: "Аналізи дітям", url: '/', img: '/assets/ico/results.svg'},
    ]
  },
  servicesSection: {
    slides: [
      {
        id:'1a',
        type: 'Пакетне дослідженя',
        code: 'Код дослідження №964',
        title: 'Краса та здоров\'я волосся',
        description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
        price: 1697,
        oldPrice: 1897,
        promotion: true,
        dueDate: 'сьогодні',
        url: '/'
      },
      {
        id:'2a',
        type: 'Пакетне дослідженя',
        code: 'Код дослідження №964',
        title: 'Краса та здоров\'я волосся2',
        description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
        price: 1697,
        oldPrice: 1897,
        promotion: false,
        dueDate: 'сьогодні',
        url: '/'
      },
      {
        id:'3a',
        type: 'Пакетне дослідженя',
        code: 'Код дослідження №964',
        title: 'Краса та здоров\'я волосся Краса та здоров\'я волосся ',
        description: '(Загальний аналіз крові Загальний аналіз крові Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
        price: 1697,
        oldPrice: 1897,
        promotion: false,
        dueDate: 'сьогодні',
        url: '/'
      },
      {
        id:'4a',
        type: 'Пакетне дослідженя',
        code: 'Код дослідження №964',
        title: 'Краса та здоров\'я волосся4',
        description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
        price: 1697,
        oldPrice: 1897,
        promotion: false,
        dueDate: 'сьогодні',
        url: '/'
      },
      {
        id:'5a',
        type: 'Пакетне дослідженя',
        code: 'Код дослідження №964',
        title: 'Краса та здоров\'я волосся',
        description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
        price: 1697,
        oldPrice: 1897,
        promotion: true,
        dueDate: 'сьогодні',
        url: '/'
      },
      {
        id:'6a',
        type: 'Пакетне дослідженя',
        code: 'Код дослідження №964',
        title: 'Краса та здоров\'я волосся2',
        description: '(Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
        price: 1697,
        oldPrice: 1897,
        promotion: true,
        dueDate: 'сьогодні',
        url: '/'
      },
      {
        id:'7a',
        type: 'Пакетне дослідженя',
        code: 'Код дослідження №964',
        title: 'Краса та здоров\'я волосся Краса та здоров\'я волосся ',
        description: '(Загальний аналіз крові Загальний аналіз крові Загальний аналіз крові (автоматизований з повною ручною лейкоформулою + ШОЕ); Тиреотропний гормон (ТТГ); Трийодтиронін вільний (Т3В); Тироксин вільний (Т4В); 25-ОН вітамін D загальний; Тестостеронзагальний (ТеЗ); Феритин; Цинк)',
        price: 1697,
        oldPrice: 1897,
        promotion: true,
        dueDate: 'сьогодні',
        url: '/'
      },
   ],
    buttons: {
      btn1: {name: 'Популярні', active: true},
      btn2: {name: 'Акції', active: false},
    },
  },
   articleSection:{
     buttons: {
       btn1: {name: 'Новини', active: true},
       btn2: {name: 'Нові', active: false},
     },
     slides: [
       {
        id: '1b',
        isNew: false,
        url: '/',
        title: 'ЩО ТАКЕ ЗАГАЛЬНОКЛІНІЧНІ ДОСЛІДЖЕННЯ?',
        description: 'Загальноклінічні дослідження в сучасній медицині не лише використовуються для діагностики, але й є ключовим елементом стратегії збереження та поліпшення здоров\'я. Їх важливість особливо проявляється напередодні або ранньому діагностуванні захворювань і проведенні профілактичних заходів.',
       },
       {
        id: '2b',
        isNew: false,
        url: '/',
        title: 'ВІДХИЛЕННЯ РЕФЕРЕНТНИХ ЗНАЧЕНЬ ТТГ. ПРО ЩО СИГНАЛІЗУЄ?',
        description: 'Не дарма щитоподібну залозу називають щитом людського організму (в перекладі з давньогрецької сама його назва означає «щит» – thyreos): вона контролює діяльність практично всіх органів і систем за допомогою вироблених нею йодовмісних гормонів.',
       },
       {
        id: '3b',
        isNew: false,
        url: '/',
        title: 'РОТАВІРУС. ЩО ЦЕ ТАКЕ І ЯК ПРОЯВЛЯЄТЬСЯ?',
        description: 'Погода нас тішить, тому відпочинок на річці у самому розпалі. Особливо це приносити радість дітям, які можуть насолоджуватися купанням. Але водночас кількість випадків інфікування ротавірусною інфекцією зростає. Ротавірус або ротавірусна інфекція – це інфекційне захворювання, що вражає слизові оболонки ротоглотки й тонкого кишківника.',
       },
       {
        id: '4b',
        isNew: true,
        url: '/',
        title: 'РОТАВІРУС. ЩО ЦЕ ТАКЕ І ЯК ПРОЯВЛЯЄТЬСЯ?',
        description: 'Погода нас тішить, тому відпочинок на річці у самому розпалі. Особливо це приносити радість дітям, які можуть насолоджуватися купанням. Але водночас кількість випадків інфікування ротавірусною інфекцією зростає. Ротавірус або ротавірусна інфекція – це інфекційне захворювання, що вражає слизові оболонки ротоглотки й тонкого кишківника.',
       },
       {
        id: '3bw',
        isNew: false,
        url: '/',
        title: 'РОТАВІРУС. ЩО ЦЕ ТАКЕ І ЯК ПРОЯВЛЯЄТЬСЯ?',
        description: 'Погода нас тішить, тому відпочинок на річці у самому розпалі. Особливо це приносити радість дітям, які можуть насолоджуватися купанням. Але водночас кількість випадків інфікування ротавірусною інфекцією зростає. Ротавірус або ротавірусна інфекція – це інфекційне захворювання, що вражає слизові оболонки ротоглотки й тонкого кишківника.',
       },
       {
        id: '4bw',
        isNew: true,
        url: '/',
        title: 'РОТАВІРУС. ЩО ЦЕ ТАКЕ І ЯК ПРОЯВЛЯЄТЬСЯ?',
        description: 'Погода нас тішить, тому відпочинок на річці у самому розпалі. Особливо це приносити радість дітям, які можуть насолоджуватися купанням. Але водночас кількість випадків інфікування ротавірусною інфекцією зростає. Ротавірус або ротавірусна інфекція – це інфекційне захворювання, що вражає слизові оболонки ротоглотки й тонкого кишківника.',
       },
     ],
   },
  
  
};

const  mainPageSlice = createSlice({
  name: 'mainPage',
  initialState,
  reducers: {
    serviceBtn: (state) => {
      state.servicesSection.buttons.btn1.active = !state.servicesSection.buttons.btn1.active;
      state.servicesSection.buttons.btn2.active = !state.servicesSection.buttons.btn2.active;
    },
    articleBtn: (state) => {
      state.articleSection.buttons.btn1.active = !state.articleSection.buttons.btn1.active;
      state.articleSection.buttons.btn2.active = !state.articleSection.buttons.btn2.active;
    },
    // setitems(state, action) {
    //   //state.list = action.payload;
    // },
    // getItems(state, action) {
    //   //action.navItems = state.nav;
    // },
  },
});

export const { serviceBtn, articleBtn } = mainPageSlice.actions;
// Описуйте дії
//export const {  } = navSlice.actions.getItems;
export default mainPageSlice.reducer;